app/views/providers/home.html.erb

SELECT "categories".* FROM "categories" WHERE "categories"."name" = 'Mantenimiento' LIMIT 1
---
        <li>
          <%= link_to(category_path(Category.find_by(name: "Mantenimiento"))) do %>